code-review/NRB_3471_3546/База_Было/Documents/ЗапросСубброкеруНаРаскрытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапросСубброкеруНаРаскрытие</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДокументаСубброкера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаСубброкера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодLEI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеференсКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТипаКорпоративногоДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеференсКДСвязанный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКДСвязанный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КДСвязанный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСпискаЛиц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеЭмитента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосРегНомерВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтправкиЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументаЗапросСубброкеруНаРаскрытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеКлиентам</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеСубброкера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LEIКодСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииИндекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииСтрана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйИндекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйСтрана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГражданствоФЛ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияФЛ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаОрганВыдачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаТип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыЮридическихЛиц</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявленнаяНалоговаяСтавка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеНалоговыхЛьгот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЮЛФЛСубклиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЮЛФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусНалогоплательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ЗапросСубброкеруНаРаскрытие/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, "");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПовторныйЗапрос = Истина;
	Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно;
	
КонецПроцедуры

// Выполняет формирование и отправку файлов раскрытия(Excel + PDF)
Процедура Отправить() Экспорт 
	
	РеквизитыКорпоративногоДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КД,"ДатаФиксации");
	ТекстСообщенияОЗаблокированномДокументе  = "Не удалось изменить документ %1, возможно он открыт. Закройте документ и повторите попытку.";
	
	Если Не ЗначениеЗаполнено(ЗаголовокСообщения)
		ИЛИ Не ЗначениеЗаполнено(ТелоСообщения) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Нет текста уведомления в запросе %1 ",Ссылка);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	НачатьТранзакцию();
	ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(КД);
	МВТ = Новый МенеджерВременныхТаблиц;
	Документы.ЗапросСубброкеруНаРаскрытие.ДобавитьИсточникДляРаскрытияИзЗапросаНаРСВ(МВТ, Ссылка);
	Если ИспользоватьРегистрациюЗапросовСубброкера Тогда 
		Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам(МВТ, РеквизитыКорпоративногоДействия.ДатаФиксации);
	Иначе 
		Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам_БезДокументовЗапросов(МВТ, РеквизитыКорпоративногоДействия.ДатаФиксации);
	КонецЕсли;
	Если КодТипаКорпоративногоДействия = "WTRC" Тогда
		ЭтоАмериканскаяЦБ = Ложь;
		Если Не ЗначениеЗаполнено(КД.ЦеннаяБумага2) Тогда 
			ЭтоАмериканскаяЦБ = Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(КД.ЦеннаяБумага1)
		ИначеЕсли Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(КД.ЦеннаяБумага1) = Истина 
			И Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(КД.ЦеннаяБумага2) = Истина Тогда 
			ЭтоАмериканскаяЦБ = Истина;
		Иначе
			ВызватьИсключение "Режим налогового регулирования США для Ценной бумаги 1 и Ценной бумаги 2, отличаются!";
		КонецЕсли;
		Если ЭтоАмериканскаяЦБ Тогда 
			ФайлРасшифровки = WTRCСообщенияQI.ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентамЦБСША(Данные,ИспользоватьРегистрациюЗапросовСубброкера);
		Иначе 
			ФайлРасшифровки = WTRCСообщенияQI.ФайлРасшифровкиЗапросаСубброкераНаРаскрытие(Данные,ИспользоватьРегистрациюЗапросовСубброкера);
		КонецЕсли;
	Иначе
		ФайлРасшифровки = WTRCСообщенияQI.ФайлРасшифровкиЗапросаСубброкераНаРаскрытие(Данные, ИспользоватьРегистрациюЗапросовСубброкера);
	КонецЕсли;
	
	Документы.РаскрытиеСпискаВладельцев.ПрисоединитьФайлКЗапросуНаРСВ(Ссылка, ФайлРасшифровки, "Раскрытие списка владельцев.xlsx", ".xlsx");
	ФайлЗапроса = WTRCСообщенияQI.ФайлЗапросаНаРаскрытиеПоСубклиентамПриложение2_5(Данные, Ссылка);
	Документы.РаскрытиеСпискаВладельцев.ПрисоединитьФайлКЗапросуНаРСВ(Ссылка, ФайлЗапроса, "Приложение 02.5. Запрос на раскрытие списка владельцев ценных бумаг.pdf", ".pdf");
	Успешно = Документы.РаскрытиеСпискаВладельцев.РезультатОтправкиЗапросаПоЭлПочте(Данные[0], ФайлЗапроса, ФайлРасшифровки);
	
	Если Не Успешно Тогда
		Если ТранзакцияАктивна() Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить запрос субброкера.");
		ЗаписьЖурналаРегистрации("Отправка запроса субброкеру на раскрытие",УровеньЖурналаРегистрации.Предупреждение,Метаданные.Документы.ЗапросСубброкеруНаРаскрытие,Ссылка,ОписаниеОшибки());
		Возврат;
	КонецЕсли;

	ДатаВремяОтправкиЗапроса = ТекущаяДатаСеанса();
	Если Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен 
		ИЛИ Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно 
		ИЛИ Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет Тогда
		Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно;
	Иначе
		Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен;
	КонецЕсли;
	Записать();
	ЗафиксироватьТранзакцию();
	
	Если КодТипаКорпоративногоДействия = "WTRC" Тогда
		Документы.РаскрытиеСпискаВладельцев.ДополнитьСписокВладельцевЗапросамиСубброкера(КД);
	ИначеЕсли ЗначениеЗаполнено(РСВ) Тогда 
		РСВОбъект = РСВ.ПолучитьОбъект();
		Попытка
			РСВОбъект.Заблокировать();
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОЗаблокированномДокументе, РСВОбъект.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецПопытки;
		РСВОбъект.ЗаполнитьСписокВладельцев();
		РСВОбъект.Записать();
		РСВОбъект.Разблокировать();
	КонецЕсли;
	       				
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(ВидКД) Тогда 
		КодТипаКорпоративногоДействия = ВидКД.Код;
	Иначе 
		КодТипаКорпоративногоДействия = "";
	КонецЕсли;
КонецПроцедуры
